'''
Самая первая задача
Напишите программу, которая пригласит человека забрать готовую пиццу из зоны выдачи, написав “Имя, Ваша пицца готова!”.

ФОРМАТ ВВОДА: 

Строка с именем

ФОРМАТ ВЫВОДА:

Фраза вида “Имя, Ваша пицца готова!”

'''

name = input ()
print(f'{name}, Ваша пицца готова!')
