'''
Калорийность продукта
Вася пришел в магазин и хочет узнать, сколько килокалорий в выбранном продукте, но на упаковке написана только ценность продукта в джоулях. Помогите Васе узнать калорийность продукта, если одна килокалория равна 4184 джоулям. 

ТРЕБУЕМАЯ ФУНКЦИЯ 

Функция get_calories, которая принимает в качестве параметра целое число joule — ценность продукта в джоулях. 
Функция должна вернуть ценность продукта в килокалориях.
В этой задаче вы только определяете функцию: не нужно считывать ввод и вызывать ее, мы сделаем это автоматически при проверке.
'''

def get_calories(cal):
    joule = cal / 4184
    return joule
        
    
    






        




    

            
        








            
        



            

